{
  "clipboard_content": "Joel Borellis\r\nwww.linkedin.com/in/joelborellis (LinkedIn)\r\njoelborellis@outlook.com (email)\r\n415-378-1502 (cell)\r\nAustin, TX 78734\r\n \r\nSummary \r\n \r\nExperienced Technology leader for enterprises and small businesses.  I have led the strategy and execution of transformative business development programs for the largest technology companies.  I am enthusiastic about growing AI technology adoption by engaging technical leaders, influencers and line of business managers.  I have an L400 understanding of AI technology trends and the emerging start-up ecosystem.  I am most proud of the many profitable partnerships I have helped build and nurture, and the successful partnership programs I have helped deliver for several Fortune 100 companies.\r\n \r\nProfessional Experience \r\n \r\nJanuary 2024 – Present \r\nDirector, AI Sales and Technical Enablement, Microsoft\r\n•\tResponsible for leading and empowering a specialist sales and technical team consisting of deep subject matter experts on Artificial Intelligence technologies in Microsoft Azure. Our team helps major enterprises plan, build, implement and adopt advanced, secure and responsible artificial intelligence capabilities including Machine Learning, Cognitive Services, and Knowledge Mining scenarios across the cloud and the edge.\r\n\r\nOctober 2021 – January 2024 \r\nPresident – gametolearn, LLC\r\n•\tFounded a small business focused on helping educators better use gaming and Generative AI technologies to achieve better outcomes with their classroom curriculum.\r\n•\tConsult small businesses on OpenAI projects to help them achieve positive business outcomes using Generative AI technologies.\r\n\r\nDecember 2020 – September 2021 \r\nSenior Manager – Solution Architecture, Amazon Web Services\r\n•\tLed customer and partner facing solution architect teams including specialized technical architects for Microsoft, SAP, VMWare, IBM and Oracle workloads running on AWS.\r\n•\tAccountable for delivering partner originated sales wins and design wins for the strategic account workloads on AWS.\r\n\r\nApril 2019 – June 2020 \r\nPrincipal Software Engineer – Commercial Software Engineering, Microsoft\r\n•\tLed customer and partner engineering engagements around Microsoft's cloud technologies with focus in Education including research institutions, K-12 and Higher Education.\r\n•\tAssisted educational institutions with their transformation of IT to modern and digital platforms.\r\n\r\nJuly 2017 – April 2019 \r\nOne Commercial Partner Technical Sales Enablement Director, Microsoft \r\n•\tLed Microsoft’s global One Commercial Partner technical team and set the direction of the partner enablement strategy and execution.  Created and delivered technical role success plans for Microsoft technical strategists and architects supporting the global partner ecosystem. Led technical architect engagement with Microsoft’s top strategic partners.\r\n•\tAccountable for delivering creative skills development initiatives, role execution guidance and technical partner plans for developing cloud offerings associated with global cloud consumption revenue goals. \r\n \r\n\r\n\r\n\r\n\r\n\r\nJanuary 2016 – July 2017 \r\nGeneral Manager, US Partner Enablement, Microsoft \r\n•\tLed Microsoft’s US Partner Development Unit teams.  Delivered the strategy and execution of the partner enablement programs and cloud solution building initiatives including managing the teams’ helping partners build cloud offerings and practices resulting in increased partner capabilities \r\n•\tAccountable for delivering the required partner solutions capacity and capability to deliver the US Subsidiary cloud consumption revenue goals. \r\n\r\nJune 2007 – January 2016 \r\nGroup Vice President, Worldwide Partner Enablement and Communications, Oracle \r\n•\tLed Oracle’s Worldwide Partner Enablement team.  Led the development of partners capabilities to sell and implement Oracle products and solutions profitably across multiple channels and in mass scale, and for creating innovative framework and standards which allow for Oracle to define and measure partners skills and competencies across all product lines.\r\n•\tServed as Oracle Executive spokesperson to analysts and press for all partner related communications. \r\n•\tAccountable for growth in partner capabilities supporting global consumption revenue goals, and for increasing partner loyalty to Oracle via communications and marketing programs and events. \r\n•\tLed Oracle’s worldwide Technical Account Management team.  Established and developed sales enablement programs for global distributors and strategic partners.  Executed pipeline management, forecasting and closing opportunities through global distributors and key partners.\r\n•\tHired, trained, and managed a team of technical account managers supporting partners sales.\r\n•\tAccountable for sales through enablement of and management of Oracle partners across established and emerging technologies.\r\n\r\nSeptember 2002 – June 2007 \r\nDirector, Global Platforms and Distribution Alliances, Oracle \r\n•\tRecreated Oracle’s partnership with Dell resulting in the largest reseller by revenue.  Responsible for pipeline management, forecasting and closing opportunities through strategic partners.  Worked closely with executive management within Oracle and their partners, directly negotiating contracts and identifying key partnership sales opportunities.  Led teams in technical integration efforts between Oracle and partners.\r\n \r\nJune 1998 – September 2002 \r\nSenior Software Engineer – Applications Engineering, Blue Martini Software \r\n•\tDeveloped key product capabilities for Blue Martini’s retail applications.  Focused development on integration with other packaged applications and legacy application architectures. \r\n•\tWorked onsite with customers to maximize their software purchase and customize options for their business requirements.\r\n•\tInstrumental part of product launch team for first version of Blue Martini Platform at large retail client.  Fielded the first implementations of Blue Martini’s premier product suite to major customers.\r\n•\tDesigned and implemented integrations between Blue Martini and existing legacy systems including developing re-useable platform for passing data to and from Blue Martini application.\r\n \r\nVolunteer and Projects \r\n \r\n•\tBoard Chair - Ability Experience – Non-profit organization benefiting individuals with disabilities.\r\n•\tEduCel, LLC - Serve as technical adviser to the EduCel, LLC board.\r\n•\tShadow Seller – Chief architect and developer on GenAI sales platform \r\n\r\nEducation \r\n\r\nBachelor of Arts in Political Science, 1992 \r\nUniversity of South Carolina, Columbia, South Carolina \r\n \r\nMaster of Science – Technology Commercialization, 2023\r\nUniversity of Texas, Austin"
}